{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Defines feature evidence mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Lists short descriptions of various frontend files and their roles in the app.",
  "frontend/.env.v1": "Environment file setting VITE_APP_VARIANT=v1.",
  "frontend/.env.v2": "Environment file setting VITE_APP_VARIANT=v2.",
  "frontend/DEPLOYMENT.md": "Guide explaining how to build and deploy the two standalone frontend versions.",
  "frontend/index.css": "CSS file defining Tailwind base layers and custom OKLCH-themed color variables.",
  "frontend/index.html": "Base HTML page loading the React app entry script.",
  "frontend/scripts/build-v1.sh": "Script that builds the v1 variant and moves output to dist-v1/.",
  "frontend/scripts/build-v2.sh": "Script that builds the v2 variant and moves output to dist-v2/.",
  "frontend/src/App.tsx": "Main app component handling simple route state and rendering Question or Success screens based on build-time variant config.",
  "frontend/src/config/appVariant.ts": "Chooses v1 or v2 build variant based on environment and exposes version‑specific heading text.",
  "frontend/src/hooks/useActor.ts": "React hook creating and updating a backend actor tied to Internet Identity state.",
  "frontend/src/hooks/useEvasiveFixedPosition.ts": "Hook computing random fixed button positions and repositions the evasive button on interaction.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity login, stored identity, and authentication state.",
  "frontend/src/index.css": "Tailwind base setup plus custom romantic theme variables, component styles, and animations for hearts and UI elements.",
  "frontend/src/main.tsx": "React entry point that mounts the app with React Query and Internet Identity provider.",
  "frontend/src/screens/QuestionScreen.tsx": "Screen showing a heading and a Yes button, with a fixed-position evasive No button using a custom hook.",
  "frontend/src/screens/SuccessScreen.tsx": "Success screen rendering floating heart animations and celebratory text.",
  "frontend/src/screens/VersionSelectScreen.tsx": "Empty placeholder file for a version selection screen.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, fonts, and container settings with romantic color variables.",
  "project_state.json": "Metadata describing project requirements and issues, especially the need for two separate standalone builds."
}