{
  "kind": "build_request",
  "title": "Publish Version 1 and Version 2 as separately deployed apps on different URLs (no in-app version selector)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Remove the single-app “version selection” entry flow and change the frontend so Version 1 and Version 2 can be published as two separate standalone deployments, each with its own distinct URL and its own root route ('/').",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Not in one page I wanted that different link for both versions like publish them differently"
        ]
      },
      "acceptanceCriteria": [
        "There is no user-facing version-selection screen required to access Version 1 vs Version 2 (each version is accessed by its own deployment URL).",
        "Version 1 loads directly at its own URL on '/' (no need to visit '/v1' first).",
        "Version 2 loads directly at its own URL on '/' (no need to visit '/v2' first).",
        "Both URLs can be opened simultaneously in two browser tabs/windows and function independently."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Ensure each standalone deployment preserves all existing behaviors and exact texts for its version: Version 1 uses heading text exactly \"Cia will you be mine forever or will stay for lifetime? ❤️\" and Version 2 uses heading text exactly \"Khusnul will you be mine forever or will stay for lifetime? ❤️\"; both keep the existing \"Yes 💖\" navigation to the success screen and the evasive \"No 💔\" behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Not in one page I wanted that different link for both versions like publish them differently"
        ]
      },
      "acceptanceCriteria": [
        "In the Version 1 deployment, the question screen heading is exactly: \"Cia will you be mine forever or will stay for lifetime? ❤️\".",
        "In the Version 2 deployment, the question screen heading is exactly: \"Khusnul will you be mine forever or will stay for lifetime? ❤️\".",
        "In both deployments, clicking/tapping \"Yes 💖\" shows the existing success screen with the exact existing success text/subtext and existing heart/confetti-style animation.",
        "In both deployments, the \"No 💔\" button remains evasive with the same fixed-position random movement rules and click/tap safety behavior as currently implemented."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add/adjust project build + deploy configuration so developers can produce and deploy two distinct frontend artifacts (Version 1 and Version 2) from the same repo, without requiring manual code edits between deployments.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "different link for both versions like publish them differently"
        ]
      },
      "acceptanceCriteria": [
        "There is a documented, repeatable way to build/deploy Version 1 and Version 2 as separate standalone frontends producing two different published URLs.",
        "Switching between Version 1 and Version 2 for deployment is controlled via configuration (e.g., build-time setting) rather than editing source files each time."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI library sources).",
    "Do not modify Internet Identity hooks under frontend/src/hooks/useInternetIdentity.ts / .tsx or frontend/src/hooks/useActor.ts (immutable paths).",
    "Keep backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not add new app features beyond separating deployments/URLs for Version 1 and Version 2.",
    "Do not change the romantic theme, button labels, success text, or evasive button mechanics.",
    "Do not add additional versions beyond Version 1 and Version 2."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}