{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Split Version 1 and Version 2 into separate standalone frontend deployments",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Remove in-app version selection and make each deployment serve its version from root route ('/') with its own URL.",
      "acceptanceCriteria": [
        "There is no user-facing version-selection screen required to access Version 1 vs Version 2 (each version is accessed by its own deployment URL).",
        "Version 1 loads directly at its own URL on '/' (no need to visit '/v1' first).",
        "Version 2 loads directly at its own URL on '/' (no need to visit '/v2' first).",
        "Both URLs can be opened simultaneously in two browser tabs/windows and function independently."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the current manual routing (/, /v1, /v2, etc.) with a standalone app router: '/' renders the question screen for the configured version, and '/success' renders the existing success screen; remove all version-select flow and any '/v1' or '/v2' route handling so each deployment operates independently at its own URL."
        },
        {
          "path": "frontend/src/screens/VersionSelectScreen.tsx",
          "operation": "delete",
          "description": "Remove the version selection screen implementation to ensure there is no user-facing version-selection entry flow in the standalone deployments."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Preserve all existing behaviors and exact texts per version, including the Yes navigation and evasive No behavior.",
      "acceptanceCriteria": [
        "In the Version 1 deployment, the question screen heading is exactly: \"Cia will you be mine forever or will stay for lifetime? ❤️\".",
        "In the Version 2 deployment, the question screen heading is exactly: \"Khusnul will you be mine forever or will stay for lifetime? ❤️\".",
        "In both deployments, clicking/tapping \"Yes 💖\" shows the existing success screen with the exact existing success text/subtext and existing heart/confetti-style animation.",
        "In both deployments, the \"No 💔\" button remains evasive with the same fixed-position random movement rules and click/tap safety behavior as currently implemented."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/appVariant.ts",
          "operation": "create",
          "description": "Add a small build-time configuration module that determines which standalone variant is being built (v1 vs v2) based on a build-time setting (e.g., a Vite environment value), and exposes the exact required heading text for the chosen variant."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the question screen heading to the build-time variant configuration so Version 1 and Version 2 show the exact required heading texts, while preserving existing behavior: \"Yes 💖\" navigates to '/success' and the existing SuccessScreen/QuestionScreen logic (including evasive No behavior) remains unchanged."
        },
        {
          "path": "frontend/src/screens/QuestionScreen.tsx",
          "operation": "modify",
          "description": "Ensure the screen remains behavior-identical after the routing changes (no changes to the evasive No mechanics and safety handling; keep the same button labels and positioning behavior), limiting any edits to compatibility with the new root-route setup."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add build/deploy configuration so two distinct frontend artifacts (v1 and v2) can be built and deployed from the same repo without code edits.",
      "acceptanceCriteria": [
        "There is a documented, repeatable way to build/deploy Version 1 and Version 2 as separate standalone frontends producing two different published URLs.",
        "Switching between Version 1 and Version 2 for deployment is controlled via configuration (e.g., build-time setting) rather than editing source files each time."
      ],
      "file_operations": [
        {
          "path": "frontend/.env.v1",
          "operation": "create",
          "description": "Create a Version 1 build configuration file defining the build-time setting used by the app variant module (e.g., a Vite env value indicating variant = v1)."
        },
        {
          "path": "frontend/.env.v2",
          "operation": "create",
          "description": "Create a Version 2 build configuration file defining the build-time setting used by the app variant module (e.g., a Vite env value indicating variant = v2)."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "create",
          "description": "Document the repeatable process to build and deploy two separate standalone frontends (v1 and v2) from the same repo using build-time configuration (e.g., building with two different modes), including how each produces a distinct published URL with root route '/'."
        },
        {
          "path": "frontend/scripts/build-v1.sh",
          "operation": "create",
          "description": "Add an optional helper script that runs the Version 1 build using configuration (no source edits) and outputs a distinct artifact directory suitable for deploying as its own URL."
        },
        {
          "path": "frontend/scripts/build-v2.sh",
          "operation": "create",
          "description": "Add an optional helper script that runs the Version 2 build using configuration (no source edits) and outputs a distinct artifact directory suitable for deploying as its own URL."
        }
      ]
    }
  ]
}